In [48]:
# Groupby

#The groupby method allows you to group rows of data together and call aggregate functions

In [49]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [50]:
df = pd.DataFrame(data)

In [51]:
df

  Company   Person  Sales
0  GOOGLE      Sam    200
1  GOOGLE  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [52]:
#** Now you can use the .groupby() method to group rows together based off of a column name. For instance 
#let's group based off of Company. This will create a DataFrameGroupBy object:**

In [53]:
df.groupby('Company')

In [54]:
#You can save this object as a new variable:

In [55]:
by_comp = df.groupby("Company")

In [56]:
#And then call aggregate methods off the object:

In [57]:
by_comp['Sales'].mean()

Company
FB        296.5
GOOGLE    160.0
MSFT      232.0
Name: Sales, dtype: float64

In [58]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOGLE   160.0
MSFT     232.0

In [59]:
#More examples of aggregate methods:

In [60]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOGLE    56.568542
MSFT     152.735065

In [61]:
#min(),max()..... etc are other aggregate methods

In [62]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOGLE        2      2
MSFT          2      2

In [63]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [64]:
by_comp.describe().transpose()

Company              FB      GOOGLE        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [65]:
by_comp.describe().transpose()['GOOGLE']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOGLE, dtype: float64

In [66]:
# Operations

#There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. 
#Let's show them here in this lecture:

In [67]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['hello','hi','bat','boards']})
df.head()

   col1  col2    col3
0     1   444   hello
1     2   555      hi
2     3   666     bat
3     4   444  boards

In [68]:
### Info on Unique Values

In [69]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [70]:
df['col2'].nunique()

3

In [71]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [72]:
### Selecting Data

In [73]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [74]:
newdf

   col1  col2    col3
3     4   444  boards

In [75]:
### Applying Functions

In [76]:
def times2(x):
    return x*2

In [77]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [78]:
df['col3'].apply(len)

0    5
1    2
2    3
3    6
Name: col3, dtype: int64

In [79]:
df['col1'].sum()

10

In [80]:
#** Permanently Removing a Column**

In [81]:
del df['col1']

In [82]:
df

   col2    col3
0   444   hello
1   555      hi
2   666     bat
3   444  boards

In [83]:
#** Get column and index names: **

In [84]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [85]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [86]:
#** Sorting and Ordering a DataFrame:**

In [87]:
df

   col2    col3
0   444   hello
1   555      hi
2   666     bat
3   444  boards

In [88]:
df.sort_values(by='col2') #inplace=False by default

   col2    col3
0   444   hello
3   444  boards
1   555      hi
2   666     bat

In [89]:
#** Find Null Values or Check for Null Values**

In [90]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [91]:
# Drop rows with NaN Values
df.dropna()

   col2    col3
0   444   hello
1   555      hi
2   666     bat
3   444  boards

In [92]:
#** Filling in NaN values with something else: **

In [93]:
import numpy as np

In [94]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [95]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [98]:
# Great Job

#ML forum VIIT